server/word_app/app/controllers/words_controller.rb

    def index
        render json: Word.all
---
SELECT "words".* FROM "words"

      def create
        word = Word.create(alphabet: params[:alphabet], words: params[:words])
---
INSERT INTO "words" ("words", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["words", "{\"alphabet\"=>\"B\", \"words\"=>\"Bee\"}"], ["created_at", "2021-03-30 11:35:42.879938"], ["updated_at", "2021-03-30 11:35:42.879938"]]

      def show
        render json: Word.find(params[:id])
---
SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

      def show
        render json: Word.find_by(alphabet: params[:id])
---
SELECT "words".* FROM "words" WHERE "words"."alphabet" = $1 LIMIT $2  [["alphabet", "B"], ["LIMIT", 1]]

      def update
        word = Word.find(params[:id])
        word.update(alphabet: params[:alphabet], words: params[:words])
---
SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "words" SET "words" = $1, "updated_at" = $2 WHERE "words"."id" = $3  [["words", "Ants"], ["updated_at", "2021-04-05 06:31:10.432756"], ["id", 1]]

      def destroy
        Word.destroy(params[:id])
---
DELETE FROM "words" WHERE "words"."id" = $1  [["id", 4]]